Repository: 84000/data-translation-memory
Catalog: toh218-v1.tmx
Source language: bo
Languages: en

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་སྡུག་བསྔལ་འདི་ལས་ཐར་པར་བྱེད་ནུས་པ་སུ་ཞིག་ཡོད་སྙམ་མོ།
en: Reflecting thus, he wondered, ‘Is there anyone who can liberate me from this misery?’

source: དེ་གཙུག་ལག་ཁང་ནས་གཙུག་ལག་ཁང་དུ་འགྲོ་ཞིང་རྒྱུ་སྟེ།
en: He wandered from temple to temple,

source: ཤིང་བཅད་པ་བཞིན་དུ་ས་ལ་སྒྱེལ་ནས། ཀྱི་ཧུད་ཀྱི་ཧུད་བདག་ནི་སེམས་ཅན་དམྱལ་བ་པར་གྱུར་ཏོ་ཞེས་ཚིག་ཏུ་སྨྲའོ།
en: and would collapse to the ground like a felled tree, weeping, ‘Oh no! Oh no! I have become a sentient being of the hell realms.’

source: དེའི་ཚེ་གཙུག་ལག་ཁང་གངས་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “At that time, there was a temple called Snow Temple.

source: དེ་གཙུག་ལག་ཁང་དེ་ག་ལ་བར་སོང་སྟེ་ཕྱིན་ནས། གཙུག་ལག་ཁང་གི་སྒོར་སོང་སྟེ། །
en: went to that temple and when he reached the entrance,

source: ས་ལ་སྒྱེལ་ནས་ཀྱི་ཧུད་ཀྱི་ཧུད་བདག་ནི་སེམས་ཅན་དམྱལ་བ་པར་གྱུར་ཏོ་ཞེས་ཚིག་ཏུ་སྨྲའོ།
en: he fell to the ground and wept, ‘Oh no! Oh no! I have become a sentient being of the hell realms.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིགས་སྒྲོལ་གཙུག་ལག་ཁང་དེའི་ནང་དུ་འགྲོ་བས་དགེ་སློང་དེ་ས་ལ་སྒྱེལ་བ་མཐོང་ནས་དེས་དེ་ལ་སྨྲས་པ། །
en: “The bodhisattva mahāsattva Liberator from Fear came into the temple, and when he saw the monk crumpled on the ground, he asked him,

source: དགེ་སློང་ཁྱོད་ཅིའི་ཕྱིར་ས་ལ་སྒྱེལ། དེས་དེ་ལ་སྨྲས་པ། །
en: ‘Monk, why have you fallen to the ground?’ “The monk replied,

source: བདག་ནི་སེམས་ཅན་དམྱལ་བ་པར་གྱུར་ཏོ།
en: ‘I have become a sentient being of the hell realms.

source: བདག་གིས་ནི་འཇིགས་སུ་རུང་བའི་ལས་བྱས་ཏེ། བདག་གིས་འཁྲིག་པ་ཡང་བྱས་ལ། །
en: I have committed a horrific deed. I have engaged in sexual intercourse,

source: མི་ཡང་བསད་དོ། །
en: and also killed a person.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་སྒྲོལ་གྱིས་དགེ་སློང་དཔས་བྱིན་དེ་ལ་སྨྲས་པ།
en: “But the bodhisattva Liberator from Fear said to the monk Vīradatta,

source: དགེ་སློང་མ་འཇིགས་ཤིག་དང་།
en: ‘Monk, do not be afraid.

source: ངས་ཁྱོད་འཇིགས་པ་མེད་པར་བྱའོ། །
en: I shall bring an end to your fear.’

source: དེ་ནས་དགེ་སློང་དཔས་བྱིན་དེས་འཇིགས་པ་མེད་པའི་སྒྲ་ཐོས་ནས། དགའ་ཞིང་མགུ་ལ་ཡི་རངས་པར་གྱུར་ཏོ། །
en: “When the monk Vīradatta heard these words of reassurance he was overjoyed and happy.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་སྒྲོལ་གྱིས་དགེ་སློང་དཔས་བྱིན་དེ་ས་ལས་བསླངས་ནས་ལག་པ་གཡས་པ་ནས་བཟུང་ནས་ནགས་སྟུག་པོ་ཞིག་གི་ནང་དུ་སོང་ནས། དེ་ནགས་སྟུག་པོ་དེར་འདུག་གོ། །
en: The bodhisattva Liberator from Fear helped the monk Vīradatta up from the ground, took him by his right hand, and they went into a thick forest, where they remained.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིགས་སྒྲོལ་ཏ་ལའི་སྲིད་ཙམ་གྱི་ནམ་མཁའ་ལ་འདུག་ནས་དགེ་སློང་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “The bodhisattva mahāsattva Liberator from Fear then hovered in space at the height of a palm tree, and asked the monk,

source: དགེ་སློང་ཁྱོད་ང་ལ་ཡིད་ཆེས་སམ།
en: ‘Monk, do you trust me?’

source: དེ་ནས་དགེ་སློང་དེས་ཐལ་མོ་སྦྱར་ནས་ཚིག་ཏུ་སྨྲས་པ།
en: “The monk joined his palms and said these words:

source: བདག་ནི་བཅོམ་ལྡན་འདས་དང་མཇལ་ཏོ། །
en: ‘I have met the Bhagavān.

source: བདག་ནི་བདེ་བར་གཤེགས་པ་དང་མཇལ་ཏོ། །
en: I have met the Sugata.’

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིགས་སྒྲོལ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པའི་སྒོ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: “At that moment, the bodhisattva mahāsattva Liberator from Fear entered the samādhi called the exalted wisdom mudrā of the tathāgatas, the entrance gate to the domain of all buddhas

source: དེ་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེའི་ལུས་ལས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གསེར་གྱི་མདོག་ཅན་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་མངའ་བ་དེ་དག་ཕྱུང་ངོ་། །
en: No sooner had he entered that samādhi than golden forms of tathāgatas endowed with the thirty-two marks of a buddha emerged from his body.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་གིས་ཀྱང་ནགས་སྟུགས་པོ་དེ་དག་ཐམས་ཅད་ཁྱབ་པར་གྱུར་ཏེ། །
en: The forms of those tathāgatas pervaded the entire forest.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་དག་གིས་གསུང་འཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Those tathāgatas spoke these verses that accord with enlightened speech:

source: ཆོས་རྣམས་འདི་དག་གཟུགས་བརྙན་འདྲ་བ་སྟེ།
en: “ ‘All these phenomena are like reflections,

source: ཆུ་ནང་ཟླ་བ་སྣང་ལ་མེད་པ་བཞིན། །
en: Just as the moon appears in water, yet is not there.

source: བྱིས་པའི་སེམས་ནི་རྨོངས་ཤིང་སྐྲག་གྱུར་ནས། །
en: Immature minds have become dim and afraid,

source: འདོད་ཆགས་དུག་དང་དེ་བཞིན་ཞེ་སྡང་རྟོག །
en: Thus creating toxic thoughts of lust and hate.

source: ཆོས་རྣམས་མཁའ་འདྲ་རྟག་ཏུ་དག་ཅིང་གསལ། །
en: “ ‘All phenomena are like space, ever pure and clear, Beyond suffering,

source: མྱ་ངན་འདས་ཤིང་གནས་མེད་ཞི་བ་ཡིན། །
en: nondwelling, and peaceful.

source: འདི་ན་ཚོར་བ་པོ་དང་བྱེད་པ་མེད། །
en: There is no one who feels or performs actions.

source: ཆོས་རྣམས་འདི་དག་ཞི་གསོག་སྙིང་པོ་མེད། །
en: All things are peace, unreal, and without essence.

source: ནང་དུ་བཙལ་ཀྱང་འདོད་ཆགས་མ་རྙེད་དེ།
en: “ ‘When examined from within, lust cannot be found,

source: ཞེ་སྡང་སུས་ཀྱང་རྙེད་པར་མ་གྱུར་ན། །
en: Nor has anyone ever discovered hate.

source: བྱིས་པའི་སྐྱེ་བོ་དག་ནི་ཆགས་སྙམ་སེམས། །
en: Immature ones believe that they are attached,

source: སུ་ཡང་འདི་ན་ཆགས་པར་གྱུར་པ་མེད། །
en: Yet there is no one who has ever been so.

source: རྨི་ལམ་དུ་ནི་བདག་གི་གཟུགས་མཐོང་སྙམ། །
en: “ ‘In dreams they believe in the forms that they see;

source: དེ་ལ་ཆགས་ཤིང་སྡང་ལ་རྨོངས་པར་གྱུར།
en: With liking and disliking their minds grow dull.

source: མཚོན་ཆ་ཐོགས་ཤིང་གསད་པར་གསོལ་པ་ན། །
en: Wielding weapons and striving to kill,

source: གསོད་པ་པོ་དང་མཚོན་ཆ་ཅི་ཡང་མེད། །
en: When in fact the weapon and killer do not exist,

source: དེ་བཞིན་འདི་ན་བྱིས་པ་འདོད་པ་སྤྱོད། །ཐབ་མོ་དག་ཀྱང་འགྱེད་ཅིང་གསོད་པར་བྱེད། །
en: “ ‘In this way, immature ones engage in lust, Combat, resistance, and also butchery.

source: གཏི་མུག་དབང་གིས་སྐྲག་ཅིང་རྨོངས་པར་གྱུར། །
en: Their minds deluded, they are frightened and dull;

source: བདག་ནི་ཆགས་སོ་སྙམ་སྟེ་དགའ་བར་འཛིན། །
en: With thoughts of “I must have this” they grasp at joy.

source: འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་རྨི་ལམ་བཞིན།
en: “ ‘These worldly preoccupations are like dreams;

source: ཆོས་རྣམས་གསོག་སྟེ་སྟོང་ཞིང་སྙིང་པོ་མེད། །
en: Such phenomena are worthless, void, of no essence.

source: སྨིག་རྒྱུ་འདྲ་ཞིང་སྤྲིན་དང་མཚུངས་པ་སྟེ།
en: Like a mirage and similar to a cloud,

source: འདོད་ཆགས་མཚན་ཉིད་མེད་ཅིང་གཏི་མུག་ཞི། །
en: Lust is without sign and delusion is peace.

source: ཆོས་རྣམས་འདི་དག་རྩྭ་དང་རྩིག་པ་བཞིན། །
en: “ ‘Phenomena resemble grass straws and walls.

source: སེམས་ནི་ནང་ན་མེད་ཅིང་ཕྱི་རོལ་མེད། །
en: Mind can be found neither inside nor outside.

source: འདོད་ཆགས་སྲོག་དང་སེམས་ཅན་གསོ་བ་མིན།
en: Lust is no living creature, nor sentient person;

source: ཞེ་སྡང་གང་ཟག་མ་ཡིན་དངོས་པོ་མེད།
en: Hate is neither an individual nor a thing.

source: ཆོས་རྣམས་འདི་དག་རྐྱེན་དང་རྒྱུ་ལས་གྲུབ། །
en: “ ‘Causes and conditions form phenomena;

source: སྒྱུ་དེ་ལ་ནི་རྨོངས་ཤིང་བྱེད་པ་མེད།
en: Illusions neither confuse nor act;

source: ཆུ་ཟླ་འདྲ་བར་བྱས་པ་མ་ཡིན་ཏེ། །
en: Like a moon in a pool of water, they are unproduced.

source: ལུས་ཀྱང་མེད་དེ་འདོད་ཆགས་གསོག་ཡིན་ནོ། །
en: The body, too, is not there; attachment to it is worthless.

source: སྒྱུ་མས་བསྒྲུབས་པ་ཡིན་ཏེ་སྟོང་པ་ཉིད། །
en: “ ‘It stems from illusion and is emptiness;

source: བྱིས་པ་དངོས་པོར་འཛིན་པས་དཔྱད་ཅིང་བརྟགས། །
en: Grasping at matter, immature ones dissect and construct.

source: སྒྱུ་མ་གསོག་སྟེ་མེད་ཅིང་སྟོང་པ་ཡིན། །
en: Illusions are worthless, absent, empty;

source: འདི་ན་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་མེད། །
en: There is no lust, hatred, and ignorance.

source: ཆོས་འདི་ཐམས་ཅད་མཚན་ཉིད་མེད་པ་སྟེ། །
en: “ ‘All phenomena are void of attributes;

source: རྩ་བ་མི་དམིགས་གཟོད་ནས་རབ་ཏུ་ཞི།
en: With no root seen, they are at peace from the first;

source: མཐའ་མ་གཟུང་མེད་དབེན་ཞིང་སྙིང་པོ་མེད།
en: Without end, they are void and lack all essence.

source: འདོད་ཆགས་འོད་གསལ་གཏི་མུག་རབ་ཏུ་ཞི།
en: Lust is clear light, ignorance is perfect peace.

source: འདི་ན་བྱིས་པ་གཟུགས་བརྙན་མཐོང་བ་ན། །
en: “ ‘When childish ones see reflected images,

source: འདི་ནི་བདག་ཡིན་སྙམ་དུ་སེམས་པར་བྱེད།
en: They believe in their identity as truth;

source: གསོག་དང་གཟུང་དུ་མེད་ལ་ཡོད་མིན་དང་། །སྙིང་པོ་མེད་པ་དེ་ལ་ལོག་པར་རྟོག །།
en: Of no worth and ungraspable, things do not exist, Yet beings wrongly view what is without essence.

source: ཆོས་རྣམས་འདི་དག་མིག་ཡོར་འདྲ་བ་སྟེ། །།
en: “ ‘These phenomena, optical illusions—

source: འདོད་ཆགས་གཏི་མུག་ཞེ་སྡང་གཟུང་དུ་མེད། །
en: Lust, delusion, and hatred, all ungraspable,

source: སྒྱུ་མ་རྨི་ལམ་ཆུ་ཟླ་ལྟ་བུ་སྟེ། །
en: Like mirages, dreams, and the moon in a pool of water,

source: འདི་ལ་སུ་ཡང་ཆགས་ཤིང་སྡང་བ་མེད། །
en: No one should crave or hate them.

source: ཡུལ་འདི་དག་ནི་དུག་མེད་སྟོང་པ་སྟེ། །
en: “ ‘They are harmless and empty.

source: དངོས་པོར་དམིགས་པ་ཐམས་ཅད་གཟུང་དུ་མེད། །
en: No perception of anything can be found;

source: འདི་དག་བརྟགས་པའི་ཆོས་ཅན་ཡོད་མ་ཡིན། །
en: None of these constructions exist.

source: དངོས་པོ་མི་དམིགས་རྩ་ནས་རབ་ཏུ་ཞི། །
en: Things are unobservable and perfectly at peace.

source: སྒྱུ་མ་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་མེད། །
en: “ ‘Delusion, lust, and hatred do not exist.

source: འདི་ལ་ནམས་ཀྱང་ཡོད་པར་འགྱུར་མ་ཡིན། །
en: These illusions will never be real.

source: ཆོས་རྣམས་སྒྱུ་མ་འདྲ་ཞིང་རྨི་ལམ་འདྲ། །
en: All phenomena, like illusions or dreams,

source: ཐོག་མ་མི་དམིགས་ཐམས་ཅད་ཡོད་མ་ཡིན། །
en: With no apparent origin—none exist.

source: ཇི་ལྟར་ཆུ་ལ་ཟླ་བ་སྣང་བཞིན་དུ། །དེར་ནི་ནམས་ཀྱང་ཞུགས་པར་གྱུར་པ་མེད། །
en: “ ‘Likewise, though it is seen in a pool, The moon never enters any water.

source: དེ་བཞིན་བྱིས་པ་སྡང་ཞིང་ཆགས་གྱུར་ཀྱང་། །འདི་ན་འདོད་ཆགས་མེད་ཅིང་ཞེ་སྡང་མེད། །
en: Just so, though the infantile hate and lust, Their hatred and desire are never real.

source: འདོད་ཆགས་གཟུང་དུ་མེད་ཅིང་ཞེ་སྡང་མེད། །
en: “ ‘Lust cannot be grasped and hate does not exist.

source: གཏི་མུག་འོད་གསལ་རྐྱེན་རྣམས་སྟོང་པ་སྟེ། །
en: Ignorance is clear light, conditions are empty.

source: སེམས་ཅན་དམིགས་སུ་མེད་ཅིང་སྲོག་ཀྱང་མེད། །
en: Beings are not perceived and there is no life.

source: ཆོས་འདི་གསོག་སྟེ་ཞི་ལ་སྙིང་པོ་མེད། །
en: All things are of no import, peaceful, and without essence.

source: མིག་ཀྱང་མེད་དེ་རྣ་བ་མེད་པ་ཡིན། །
en: “ ‘There are no eyes, nor are there ears.

source: སྣ་ཡང་མི་སྣང་ལྕེ་ཡང་དེ་བཞིན་ཏེ། །
en: The nose cannot be found, nor can the tongue;

source: ནམ་མཁའ་ལ་ནི་ཇི་ལྟར་མཐའ་མེད་ཅིང་། །ཟད་པར་མི་འགྱུར་སྐྱེ་བ་མེད་པ་བཞིན། །
en: “ ‘Space is boundless, limitless, endless, Inexhaustible, and unproduced.

source: འདི་དག་བེམས་པོའི་ཆོས་ཅན་སྙིང་པོ་མེད། །
en: Nothing material has any essence.

source: བྱིས་པའི་སྐྱེ་བོ་རྨོངས་བྱེད་མྱོས་པར་བྱེད། །
en: Intoxicated, the childish are confused.

source: ཆོས་རྣམས་འདི་དག་ཐམས་ཅད་དེ་བཞིན་ཏེ། །
en: So, too, are all phenomena—

source: ནམ་མཁའི་ཆུ་ལྟར་དག་ཅིང་རྣམ་པར་དག །
en: They are like rain in the sky, pristine and crystal clear.

source: ཆོས་རྣམས་རྣམ་པ་སྣ་ཚོགས་བརྟགས་པ་སྟེ། །
en: “ ‘Manifold phenomena are all fabricated,

source: བརྟགས་ན་དེ་ཡང་ནམས་ཀྱང་ཡོད་མ་ཡིན། །
en: But none of those fabrications are ever real.

source: ཤེས་ལྡན་དངོས་དང་དངོས་མིན་རྣམ་འཇིག་ཅིང་། །ཆོས་ཉིད་འདི་དག་ཐམས་ཅད་ཞི་བར་མཐོང་། །ཐམས་ཅད་མ་སྐྱེས་གཟུང་དུ་མེད་པར་མཐོང་། །
en: “ ‘The wise do not think of real and unreal, But see the true nature of all things as peace, Unarisen and ungraspable.

source: བྱིས་པ་ཕུང་པོ་འདི་དག་འདྲ་བར་འཛིན། །
en: The infantile grasp at the skandhas like that, too,

source: དེ་ཡང་དེ་ལ་ནམས་ཀྱང་ཡོད་མ་ཡིན། །
en: But none of them, either, are ever real.

source: དེ་ཡི་ལུས་ནི་ནམས་ཀྱང་ཡོད་པ་མིན། །
en: Nor have their own bodies ever existed.

source: ཆོས་རྣམས་འོད་གསལ་གྲོལ་ཞིང་རབ་ཏུ་གྲོལ། །ཞི་ཞིང་མི་གནས་མྱ་ངན་འདས་གྱུར་ལ། །
en: “ ‘All things are luminous, unfettered and free, Peaceful, nonabiding, beyond misery;

source: དེ་ལ་ནམས་ཀྱང་གཟུང་དུ་མེད་པ་སྟེ། །
en: None of them can be seized.

source: ཤེས་ལྡན་དེ་ལྟར་རྟོགས་ན་གྲོལ་བར་འགྱུར། །
en: When they know this, the wise will be free.’

source: དེ་ནས་ནགས་ཁྲོད་དེར་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་སྒྲོལ་ལས་ཆོས་མཉན་པའི་ཕྱིར་ལྷའི་བུ་བཞི་ཁྲི་ཉིས་སྟོང་ལྷགས་པར་གྱུར་པ་དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་བསྟན་པ་དེ་དག་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: “In order to hear the teaching of the bodhisattva Liberator from Fear, forty-two thousand sons of gods assembled in the forest, and upon hearing these verses of teachings, they attained patient forbearance in seeing all phenomena as nonarising.

source: དགེ་སློང་དཔས་བྱིན་དེ་ཡང་ཀུན་ནས་དཀྲིས་པ་དང་བྲལ་བར་གྱུར་ཏེ།
en: The monk Vīradatta also became completely free of fetters, and

source: དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་བཀོད་པ་དེ་དག་མཐོང་ནས་བྱང་ཆུབ་ཀྱི་ཚུལ་དང་ལྡན་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་རང་བཞིན་རབ་ཏུ་རྣམ་པར་འབྱེད་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: seeing with a genuine mind of enlightenment the array of the tathāgata’s emanations, he fully recognized the nature of this teaching and attained patient forbearance in seeing all phenomena as nonarising.

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་སྒྲོལ་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་ན་དེ་ལྟར་མི་བལྟའོ། །
en: “Mañjuśrī, should you wonder whether at that time the bodhisattva Liberator from Fear was someone else, you will not find it so.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་སྒྲོལ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Why? Because the bodhisattva Maitreya was the bodhisattva Liberator from Fear at that time.

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་དཔས་བྱིན་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་ན་དེ་ལྟར་མི་བལྟའོ། །
en: Mañjuśrī, should you wonder whether at that time the monk Vīradatta was someone else, you will not find it so.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་དེ། དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་དཔས་བྱིན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Why? Because the Tathāgata Jewel Moon Performing Enlightened Actions was the monk Vīradatta at that time.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་དཔས་བྱིན་དེ་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ལགས་སམ། །
en: At this, Youthful Mañjuśrī asked the Bhagavān, “Bhagavān, did the monk Vīradatta attain manifest complete enlightenment?”

source: བཅོམ་ལྡན་འདས་དགེ་སློང་དཔས་བྱིན་དེ་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ལགས་སམ།
en: “Bhagavān, did the monk Vīradatta attain manifest complete enlightenment?”

source: འཇམ་དཔལ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཟིན་ཏེ།
en: “Mañjuśrī, he attained manifest complete enlightenment

source: དེ་ནི་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་རྟག་པ་ཞེས་བྱ་བ་དེར་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: and became the Tathāgata Jewel Moon in the West, as many buddhafields beyond this buddhafield as there are sand grains in the river Ganges, in a world system called Eternal Light.

source: འཇམ་དཔལ་ཆོས་འདི་དག་གི་སྒྲུབ་པ་བྱེད་པ་དག་ཇི་ཙམ་འདོད་པ་དག་ཀྱང་ཡོངས་སུ་ལོངས་སྤྱད་ལ། སྲོག་གི་བར་ཆད་ཀྱང་བྱས་བཞིན་དུ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་པ་ལ་ལྟོས།
en: “Mañjuśrī, consider how someone who practiced this Dharma teaching attained patient forbearance in seeing all phenomena as nonarising despite having partaken of all that he desired and even having interrupted another’s life.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་ཁམས་གསུམ་པ་ཐམས་ཅད་ཡང་དག་པ་མ་ཡིན་པར་ཤེས་ཤིང་སེམས་ཅན་ཐམས་ཅད་མིག་ཡོར་དང་འདྲ་བར་ཤེས་པའི་ཕྱིར་རོ། །
en: How could that be? It was because he understood that everything in the three realms is untrue, and that all sentient beings are like optical illusions.

source: འཇམ་དཔལ་སྒྱུ་མ་ལྟ་བུའི་སེམས་ལ་གནས་པ་ལ་ནི་ཆོས་གང་ལ་ཡང་སྒྲིབ་པ་མེད་དོ། །
en: Mañjuśrī, when one abides in the illusion-like mind there is no obscuration with respect to any phenomenon.

source: འཇམ་དཔལ་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་རང་གི་རྟོག་པས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ལྟུང་བར་འགྱུར་ཏེ།
en: Further, Mañjuśrī, childish ordinary beings fall into the hell realms, or into birth as an animal, or into the realm of the Lord of Death due to their own discursive thoughts.

source: མེད་པའི་ཆོས་རྣམས་ལ་ཡོངས་སུ་བརྟགས་པས་སྡུག་བསྔལ་འབུམ་ཕྲག་མང་པོ་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ། །
en: Imagining nonexistent phenomena, they experience infinite suffering.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། བསྟི་སྟང་བགྱིད་པ་དེས་ཚེ་འདི་ཉིད་ལ་ཡོན་ཏན་ཇི་སྙེད་ཅིག་ཐོབ་པར་འགྱུར་ལགས།
en: “Bhagavān, what qualities will a bodhisattva who comprehends, upholds, perfectly masters, and honors this Dharma discourse obtain in this very life?”

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས། ཉི་མའི་དཀྱིལ་འཁོར་ཤར་བ་ན་འཛམ་བུའི་གླིང་པའི་མི་རྣམས་ལ་ཡོན་ཏན་གྱི་ཕན་ཡོན་ཇི་ཙམ་དུ་འགྱུར། །
en: “Mañjuśrī, what do you think? How beneficial is it to the people of Jambudvīpa when the sun rises?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཡོན་ཏན་གྱི་ཕན་ཡོན་དཔག་ཏུ་མ་མཆིས་ཤིང་སྣང་བ་ཚད་མ་མཆིས་པར་འགྱུར་ཏེ།
en: “Bhagavān,” answered Mañjuśrī, “the benefit is inconceivable; there is boundless light.

source: དེས་ནི་མི་རྣམས་སུག་ལས་བགྱིད་པར་འགྱུར་ལགས་སོ། །
en: It allows people to engage in activities.”

source: འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཉོན་མོངས་པ་ཐམས་ཅད་བསལ་ནས།
en: “Mañjuśrī, likewise, through this Dharma discourse, all the bodhisattva’s afflictions will be dispelled and

source: ཤེས་རབ་ཀྱི་སྣང་བ་ཚད་མེད་པ་སྐྱེད་པར་བྱེད་དོ།
en: the boundless light of exalted wisdom will arise.

source: ཆོས་ཐམས་ཅད་ལ་ཡང་སྒྲིབ་པ་མེད་པ་ཐོབ་པར་འགྱུར་རོ།
en: He will then attain freedom from obscurations with regard to all phenomena.

source: ཡོངས་སུ་གདུང་བ་དང་བྲལ་ཞིང་ཀུན་ནས་དཀྲིས་པ་ཡང་མེད་པར་འགྱུར་རོ།
en: He will become free of misery, and all fetters will also vanish.

source: དེ་ལ་ཆགས་པ་མེད་པའི་སྤོབས་པ་ཡང་མྱུར་དུ་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: He will also swiftly actualize unattached confidence.

source: བདུད་དང་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་རྫི་བར་འགྱུར་རོ། །
en: No māra or adversary will be able to overcome him.

source: ཆོས་ཀྱང་སྟོན་ཏེ། སྤོབས་པ་མཐར་ཐུག་པ་མེད་པས་སྟོན་པར་འགྱུར་རོ། །
en: He will also teach the Dharma, and moreover he will teach the Dharma with limitless confidence.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན་མེ་བྱུང་ན་རྩྭ་དང་ཤིང་ཐམས་ཅད་སྲེག་པར་བྱེད་དོ། །
en: Mañjuśrī, it is like this: just as when a fire takes hold, it burns away all grass and wood,

source: འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདིས་ཡང་ཉོན་མོངས་པ་ཐམས་ཅད་སྲེག་པར་བྱེད་དོ། །
en: likewise, Mañjuśrī, this Dharma discourse burns away all afflictions.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་གངས་ཀྱིས་རི་ནག་པོ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཏོ། །
en: Mañjuśrī, it is like this: just as the majestic snow mountain outshines all the black mountains, likewise,

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཁས་པས་ནི་ཕ་རོལ་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་ལྡན་པས་ཚར་བཅད་ནས་ཟིལ་གྱིས་གནོན་པར་བྱེད་དོ། །
en: Mañjuśrī, a bodhisattva who is skilled in this Dharma discourse subjugates and outshines in virtue all opponents.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་ནི་ཁམས་ཀྱི་རྒྱལ་པོ་རྣམས་ཟིལ་གྱིས་གནོན་ཏོ། །
en: Mañjuśrī, it is like this: just as the wheel-turning emperor outshines all regional kings, likewise,

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་གནས་པས་ནི་གང་ཟག་ཚིག་དང་ཡི་གེའི་འབྲུ་སྣ་ཚོགས་ཐམས་ཅད་ལ་མཁས་པ་རྣམས་ཟིལ་གྱིས་གནོན་ཏོ། །
en: Mañjuśrī, a bodhisattva who abides by this Dharma discourse outshines those who are skilled in language and composition.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན། དགེ་སློང་འདུལ་བ་འཛིན་པ་ནི་ལྟུང་བ་ཐམས་ཅད་འདུལ་བ་ལ་མཁས་པ་ཡིན་ནོ། །
en: Mañjuśrī, it is like this: just as a monk who holds to the rules of the Vinaya is skilled in controlling all downfalls, likewise,

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཁས་པ་ནི་ཕྱོགས་བཅུའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འགྱོད་པ་སེལ་བར་བྱེད་དོ། །
en: Mañjuśrī, a bodhisattva who is skilled in this Dharma discourse dispels the regret of all sentient beings of the ten directions.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་ཤར་ན་མུན་པ་མུན་ནག་ཐམས་ཅད་མེད་པར་འགྱུར་རོ། །
en: Mañjuśrī, it is like this: just as the rising sun makes all gloomy darkness disappear,

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཁས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སེལ་བར་བྱེད་དེ་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཡང་བྱེད་པར་འགྱུར་རོ། །
en: likewise, Mañjuśrī, a bodhisattva who is skilled in this Dharma discourse dispels the afflictions of all sentient beings and thus causes the light of exalted wisdom to manifest.

source: འཇམ་དཔལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་སློབ་པ་གང་ཡིན་པ་དེ་ནི་ལྷག་པའི་ཤེས་རབ་ལ་སློབ་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Mañjuśrī, this is because whoever trains in this Dharma discourse trains in the higher training of transcendent awareness.”

source: དེ་ནས་བདུད་སྡིག་ཅན་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the evil Māra came to the Bhagavān and said to the Bhagavān,

source: བཅོམ་ལྡན་འདས་ཁྱོད་ནི་ཐུགས་རྗེ་དང་ལྡན་པ་ལགས་ཏེ། །
en: “Bhagavān, you are compassionate.

source: ཁྱོད་ནི་ཐུགས་རྗེ་དང་ལྡན་པ་ལགས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་སྨན་པ་དང་། ཐུགས་བརྩེ་བ་ཅན་ལགས་ན།
en: You are the physician of all sentient beings and endowed with a loving heart. If that is so,

source: བཅོམ་ལྡན་འདས་བདུད་ཀྱི་གནས་ཐམས་ཅད་རབ་ཏུ་གཡོས་ཏེ། །
en: Bhagavān, all the abodes of Māra are shaken,

source: བདག་ཀྱང་མྱ་ངན་གྱི་ཟུག་རྔུས་ཟུག་ལགས་ཀྱིས།
en: and I too am stricken with painful suffering.

source: བཅོམ་ལྡན་འདས་ཡང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མི་བཤད་པར་གསོལ། །
en: Bhagavān, please do not expound this Dharma discourse.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཅི་ནས་འཛམ་བུའི་གླིང་དུ་སྤྱོད་པར་མི་འགྱུར་བ་དེ་ལྟར་བགྱིའོ། །
en: Bhagavān, I will do anything so that this Dharma discourse is not practiced in Jambudvīpa.

source: ཅི་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སུ་ཡང་འཛིན་པར་མི་འགྱུར། འཆང་བར་མི་འགྱུར། ཀུན་ཆུབ་པར་བགྱིད་པར་མི་འགྱུར་བ་དེ་ལྟ་བུར་ཡང་བགྱིའོ། །
en: I will do anything so that no one comprehends, holds, and masters this Dharma discourse.

source: ཅི་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ལམ་ངན་པར་འདུ་ཤེས་པར་འགྱུར་བར་ཡང་བགྱིའོ། །
en: I will do anything to make beings perceive this Dharma discourse as a wrong path.

source: དེ་དག་ཤིན་ཏུ་རྒྱས་པའི་མདོ་སྡེ་དག་ལ་ལོག་པར་ལྟ་བའི་འདུ་ཤེས་སུ་འགྱུར་བར་ཡང་བགྱིའོ། །
en: I will make them perceive the elaborate sūtras with corrupt views.

source: དགེ་སློང་དེ་དག་ཅི་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤོང་བར་འགྱུར་བའི་ཀུན་ནས་དཀྲིས་པ་འགའ་འབྱུང་བར་ཡང་བགྱིའོ། །
en: I will employ all means to make various fetters arise so the monks abandon this Dharma discourse.”

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས། །
en: At that moment, by the Buddha’s miraculous powers, Indra, the chief of gods, appeared before the Bhagavān.

source: དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་མན་དཱ་ར་བ་དག་གིས་གཏོར་ནས།
en: He prostrated with his head to the Bhagavān’s feet, cast mandārava flowers toward the Bhagavān,

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བདུད་སྡིག་ཅན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནུབ་པར་བགྱིད་པའི་སླད་དུ་རྩོལ་བར་གྱུར་ན། །
en: “Bhagavān, if the evil Māra deliberately tries to make this Dharma discourse decline,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་བར་བགྱི། །
en: Bhagavān, then I shall comprehend this Dharma discourse;

source: བཅང་བར་བགྱི། ཀུན་ཆུབ་པར་བགྱིའོ།
en: I shall hold it, and perfectly master it.

source: བཅོམ་ལྡན་འདས་དང་བཙུན་པ་ཀུན་དགའ་བོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་ཡང་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛམ་བུའི་གླིང་དུ་སྤྱོད་པར་འགྱུར་བར་བགྱིའོ། །
en: And after you, the Bhagavān, and the venerable Ānanda have passed into parinirvāṇa, I shall cause this Dharma discourse to be practiced in Jambudvīpa.

source: ཆོས་སྨྲ་བ་དེ་ལ་ཡང་རྒྱལ་པོ་ཆེན་པོ་བཞི་གནོད་སྦྱིན་གྱི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་པ་རྣམས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བར་བགྱིད་དུ་སྩལ་བར་འཚལ་ཏེ། །
en: I shall command the Four Great Kings and the host of yakṣas, together with their retinues, to guard, protect, and shield this teaching.
